Revit 2027 API
Mesh.NumTriangles Property
The number of triangles that the mesh contains.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumTriangles { get; }
Public ReadOnly Property NumTriangles As Integer
	Get
public:
property int NumTriangles {
	int get ();
}
member NumTriangles : int with get
Property Value
Int32
See Also
Reference
Mesh Class
Autodesk.Revit.DB Namespace